journalctl-mode.org
;; -*- coding: utf-8; lexical-binding: t; -*-
#+TITLE: journalctl-mode
#+AUTHOR: Sebastian Meisel
#+DATE: <2023-06-07 Mi>
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle tesseract.el :results silent auto-tangle: yes

* General

** Header

#+BEGIN_SRC emacs-lisp
;;; journalctl-mode.el --- Sample major mode for  viewing output journalctl 

;; Copyright © 2020, by Sebastian Meisel

;; Author: Sebastian Meisel <sebastian.meisel@gmail.com>
;; Version: 0.9
;; Created:  June 1, 2020
;; Keywords: unix
;; Homepage: https://github.com/SebastianMeisel/journalctl-mode
;; Package-Requires: ((emacs "24.1"))

;; This file is not part of GNU Emacs.
#+END_SRC

** Licence

#+BEGIN_SRC emacs-lisp
;;; License:

;; This file is free software: you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation, either version 3 of the License,
;; or (at your option) any later version.
;;
;; This file is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with this file.  If not, see <https://www.gnu.org/licenses/>.

#+END_SRC

** Commentary

#+BEGIN_SRC emacs-lisp
;;; Commentary:

;; This is a major-mode for Emacs to view systemd's journalctl output in Emacs.
;; The output is split into chunks for performance reasons.
;; Fontification is provided and may be customized.
;; At the moment it is still in very early development.  Please give feedback on any problems that occur.

;; Put journalctl-mode.el in your load-path and add   ( require 'journalctl-mode)  to your .emacs file.

#+END_SRC

* Code
** TODO Requirements -> Add Transient

This library provides functions and utilities related to array manipulation and handling in Emacs Lisp programs:

#+BEGIN_SRC emacs-lisp
;;; Code:

(require 'array)

#+END_SRC

** Customization

 - (defgroup journalctl nil ...) creates a customization group named "journalctl" within Emacs. It provides a grouping for related customization options.
 - (defcustom journalctl-chunk-size ...) defines a customizable variable named "journalctl-chunk-size" which determines the number of lines of journalctl output loaded in the buffer at a time. The value can be adjusted to control the navigation within the output.
 - (defcustom journalctl-error-keywords ...) defines a customizable variable named "journalctl-error-keywords" that contains a list of keywords representing errors in journalctl output.
 - (defcustom journalctl-warn-keywords ...) defines a customizable variable named "journalctl-warn-keywords" that contains a list of keywords representing warnings in journalctl output.
 - (defcustom journalctl-starting-keywords ...) defines a customizable variable named "journalctl-starting-keywords" that contains a list of keywords indicating the start of processes or steps in journalctl output.
 - (defcustom journalctl-finished-keywords ...) defines a customizable variable named "journalctl-finished-keywords" that contains a list of keywords indicating the completion of processes or steps in journalctl output.


#+BEGIN_SRC emacs-lisp
;; customization

(defgroup journalctl nil
  "View journalctl output in a emacs buffer."
  :group 'external)

(defcustom journalctl-chunk-size
  250
 "Number of lines of journalctl output that are loaded in the buffer.
 You can navigate."
  :group 'journalctl
  :type 'integer)
  
(defcustom journalctl-error-keywords
  '("Failed" "failed" "Error" "error" "critical" "couldn't" "Can't" "not" "Not" "unreachable")
  "Keywords that mark errors in journalctl output."
  :group 'journalctl
  :type 'string)

(defcustom journalctl-warn-keywords
  '("Warning" "warn" "debug")
  "Keywords that mark warnings in journalctl output."
  :group 'journalctl
  :type 'string)

(defcustom journalctl-starting-keywords
  '("Starting" "Activating" "Listening" "Reloading" "connect")
  "Keywords that mark start of processes or steps in journalctl output."
  :group 'journalctl
  :type 'string)

(defcustom journalctl-finished-keywords
  '("Stopped" "Stopping" "Reached" "Closed" "finished" "Started" "Successfully activated"
    "Received" "opened" "success" "enabled" "removed" "active" "Created" "loaded" "detected")
  "Keywords that mark finished processes or steps in journalctl output."
  :group 'journalctl
  :type 'string)

#+END_SRC

*** Faces

#+BEGIN_SRC emacs-lisp
;;; faces
(defface journalctl-error-face
  '((t :inherit error))
  "Face to mark errors in journalctl's output."
  :group 'journalctl)

(defface journalctl-warning-face
  '((t :inherit warning))
  "Face to mark warnings in journalctl's output."
  :group 'journalctl)

(defface journalctl-starting-face
  '((t :inherit success))
  "Face to mark starting units in journalctl's output."
  :group 'journalctl)

(defface journalctl-finished-face
  '((t :inherit success :bold t))
  "Face to mark finished units in journalctl's output."
  :group 'journalctl)

(defface journalctl-timestamp-face
  '((t :inherit font-lock-type-face))
  "Face for timestamps in journalctl's output."
  :group 'journalctl)

(defface journalctl-host-face
  '((t :inherit font-lock-keyword-face))
  "Face for hosts in journalctl's output."
  :group 'journalctl)

(defface journalctl-process-face
  '((t :inherit font-lock-function-name-face))
  "Face for hosts in journalctl's output."
  :group 'journalctl)

#+END_SRC

** Allgemeine Variablen

The following  variables facilitate the management and tracking of journalctl output within the journalctl-buffer in Emacs, providing control over the loaded chunks, line counts, previous options, and applied filters:

#+BEGIN_SRC emacs-lisp
(defvar journalctl-current-chunk
  0
  "Counter for chunks of journalctl output loaded into the *journalctl*-buffer.")

(defvar journalctl-current-lines
  0
  "Number of lines  of journalctl output with current opts.")


(defvar journalctl-current-opts
  ""
  "Keeps the options of  the last call of journalctl.")

(defvar journalctl-current-filter
  ""
  "Keeps filters as grep that shall be applied to journalctl's output.")

#+END_SRC

** Functions
*** Disk Usage

=journalctl--disk-usage=  retrieves the disk usage information of the journalctl command. It executes the shell command "journalctl --disk-usage" and captures the output using "shell-command-to-string." If the output contains a match for a pattern resembling a disk usage value (in gigabytes), it extracts and returns that value. Otherwise, it returns "0G" to indicate no disk usage:

#+BEGIN_SRC emacs-lisp
;; functions

(defun journalctl--disk-usage ()
  "Disk-usage of journalctl."
  (let ((cmd-out (shell-command-to-string "journalctl --disk-usage")))
    (if (string-match "[0-9.]+G" cmd-out)
        (match-string 0 cmd-out)
      "0G")))
#+END_SRC

*** TODO Option handling -> Tansient
**** List of Options

#+BEGIN_SRC emacs-lisp
(defvar journalctl-list-of-options
  '("x" "b" "k" "S" "U" "l" "a" "e" "n" "r" "o"  "q" "m" "t" "u" "p"
   "F" "M" "D"
   "since" "until" "dmesg" "boot"
   "system" "user"
   "unit" "userunit"
   "directory" "file" "machine" "root"
   "nofull" "full" "all"
   "pagerend"
   "output"   "outputfields"
   "utc"
   "nohostname"
   "catalog" "quiet"
   "merge"
   "identifier" "priority"
   "fields" )
  "List of possible options to be given to journalctl without the first dash." )
#+END_SRC

