journalctl-mode.org
**** Add Options

=journalctl-parse-options=  takes an argument =opt= representing the options provided to the =journalctl= command. Here's a description using a list:

1. *Splitting options*: The function splits the options string using spaces and hyphens as delimiters and constructs a list of parsed options. Each option is further split using regular expressions to extract the option name and its possible value.
2. *Validating options*: The function checks each option against a predefined list named =journalctl-list-of-options=. If an option is not valid, it is removed from the list of parsed options. This ensures that only valid options remain in the list.
3. *Error message*: If an invalid option is found, a message is displayed indicating that the option will be skipped. This provides feedback to the user regarding invalid options.
4. *Setting variable*: The function sets the variable =journalctl-current-opts= to the parsed and validated options list. This allows the options to be accessed and utilized later in the code.

By performing these steps, the =journalctl-parse-options= function provides a mechanism to parse, validate, and store the options provided to the journalctl command, ensuring that only valid options are considered for further processing.

#+BEGIN_SRC emacs-lisp
(defun journalctl-parse-options (opt)
 "Parse options (OPT)  given to journalctl."
 (interactive)
 (let ((opt-list nil))
 (let  ((list  (split-string	opt " -" t "[- ]+")))
    (while list
      (setq opt-list (cons (split-string   (car list) "[= ]+" t "[ ']*") opt-list))
      (setq list (cdr list))))
  ;;  Add function to test the options and maybe values
  (let ((list opt-list))
     (while  list
      (let ((this-opt (car (car list))))
    (unless (member  this-opt  journalctl-list-of-options)
      (progn
	;; skip invalid option
	(setq opt-list (delete (car list) opt-list))
	(message "Option %s is not valid and will be skipped."   this-opt))))
      (setq list (cdr list))))
  ;;set journalctl-current-opts to  opt-list
  (setq journalctl-current-opts opt-list)))

#+END_SRC

=journalctl-unparse-options= that converts a list of options into a string format suitable for the journalctl command. Here's a description using a list:

1. *Initialization*: The function initializes the variable =opt= with a space character to start building the output string. It also assigns the list of options from the variable =journalctl-current-opts= to =opt-list= for processing.
2. *Iterating over options*: The function iterates over each option in the =opt-list= using a while loop.
3. *Handling options with values*: For options that require a value, the function checks the length of the option name to determine if it is a long or short option. It constructs the appropriate format by appending the option name with an equal sign for long options or a space for short options. The option value is processed by concatenating each value chunk, separated by spaces. The value is enclosed in single quotes.
4. *Concatenating options*: The function concatenates each processed option to the =opt= string.
5. *Handling options without values*: For options that do not require a value, the function checks the length of the option name to determine if it is a long or short option. It appends the option name with two dashes for long options or one dash for short options.
6. *Displaying the result*: The function displays the resulting =opt= string using the =message= function.


#+BEGIN_SRC emacs-lisp
(defun journalctl-unparse-options ()
 "Join options to  a string, this is given to  journalctl."
 (interactive)
 (let* ((opt " ")
	(opt-list journalctl-current-opts))
     (while opt-list
       (let ((this-opt (car opt-list)))
	 (if (> (length this-opt) 1) ;; check if option needs a value
	    (setq opt  (concat opt
		     (if (> (string-width (car this-opt)) 1) ;; long or short options
			    (concat "--" (car this-opt) "=");; long option with value
			    (concat "-" (car this-opt) " "));; short option with value
		     (let ((value "'")
			   (value-chunks (cdr this-opt)))
		       (while value-chunks ;; value may co ntain spaces -> saved as list
			 (setq value (concat value (car value-chunks) " "))
			 (setq value-chunks (cdr value-chunks)))
		       (when (string-equal (substring value  -1) " ") (setq value (substring value 0 -1)))
		       value)
		     "' "))
	   ;; else
	   (if (> (string-width (car this-opt)) 1) ;; long or short options
	       (setq opt (concat opt "--" (car this-opt) " "))
	     (setq opt (concat opt "-" (car this-opt) " ")))))
       (setq opt-list (cdr opt-list)))
     (message "%s" opt)))

#+END_SRC

**** TODO Adding and removing options -> Transient
#+BEGIN_SRC emacs-lisp
(defun journalctl-add-opt (&optional opt)
  "Add options to journalctl call.

If OPT is set, use these options."
  (interactive)
  (let* ((opt-list nil)
	(opt (or opt (read-string "option: " "" nil ))))
    (let  ((list  (split-string	opt " -" t "[- ]+")))
    (while list
      (setq opt-list (cons (split-string   (car list) "[= ]+" t "[ ']*") opt-list))
      (setq list (cdr list))))
    ;;  Add function to test the options and maybe values
    (let ((list opt-list))
      (while  list
	(let ((this-opt (car (car list))))
	  ;; delete old option values if given.
	  (when  (member  this-opt (mapcar (lambda (arg) (car arg)) journalctl-current-opts))
	    (setq journalctl-current-opts (delq (assoc this-opt journalctl-current-opts)
						journalctl-current-opts)))
        (unless (member  this-opt  journalctl-list-of-options)
	  (progn
	;; skip invalid option.
	(setq opt-list (delete (car list) opt-list))
	(message "Option %s is not valid and will be skipped."   this-opt))))
      (setq list (cdr list))))
    ;;add opt-list to  journalctl-current-opts.
    (setq journalctl-current-opts  (append opt-list journalctl-current-opts)))
    (journalctl t journalctl-current-chunk))

#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun journalctl-add-since (&optional date)
  "Add '--since' option with DATE or ask for date."
  (interactive)
  (let ((date (or  date
		   (if  (fboundp 'org-read-date)  (org-read-date t)
		     (read-string "Date [yy-mm-dd [hh:mm[:ss]]]: ")))))
     (journalctl-add-opt (concat " --since='" date "'"))))

(defun journalctl-add-until (&optional date)
  "Add '--until' option with DATE or ask for date."
  (interactive)
  (let ((date (or  date
		   (if  (fboundp 'org-read-date)  (org-read-date t) (read-string "Date [yy-mm-dd [hh:mm[:ss]]]: ")))))
     (journalctl-add-opt (concat " --until='" date "'"))))

#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun journalctl-add-priority (&optional priority to-priority)
  "Add '--priority' option with PRIORITY.
If TO-PRIORITY is non-nil, call '--priority' with range
from PRIORITY  TO-PRIORITY.
If none is non-nil it will prompt for priority (range)."
  (interactive)
  (let* ((from-priority (or  priority (completing-read "Priority: "
						 '("emerg" "alert" "crit" "err" "warning" "notice" "info" "debug")
						 nil t "warning")))
	 (to-priority (if  priority
			 (or to-priority nil)
			(or to-priority  (completing-read "Priority: "
						 '(("emerg" "alert" "crit" "err" "warning" "notice" "info" "debug"))
						 nil nil priority))))
	 (opt (concat "--priority='" from-priority (when to-priority
						       (unless (string-equal from-priority to-priority) (concat ".." to-priority))) "'")))
     (journalctl-add-opt opt)))

#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun journalctl-remove-opt (&optional opt)
  "Remove option from journalctl call.

If OPT is set, remove this option."
  (interactive)
  (let* ((opt-list (mapcar (lambda (arg) (car arg)) journalctl-current-opts))
	 (opt (or opt (completing-read "option: " opt-list  nil t))))
    (when  (member opt opt-list)
      (setq journalctl-current-opts (delq (assoc opt journalctl-current-opts) journalctl-current-opts))))
    (journalctl t journalctl-current-chunk))

#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun journalctl-grep (&optional pattern)
  "Run journalctl with -grep flag to search for PATTERN."
  (interactive)
  (let ((pattern (or pattern (read-string "grep pattern: " nil nil ))))
    (setq journalctl-current-filter (concat journalctl-current-filter  "| grep '" pattern "'" ))
    (journalctl journalctl-current-opts journalctl-current-chunk)))

#+END_SRC

#+BEGIN_SRC emacs-lisp
(defun journalctl-remove-filter ()
  "Remove all filters such as grep from journalctl output."
  (interactive)
  (setq journalctl-current-filter "")
    (journalctl journalctl-current-opts journalctl-current-chunk))

#+END_SRC
  
#+BEGIN_SRC emacs-lisp
(defun  journalctl-edit-opts ()
  "Edit the value of 'journalctl-current-opts'."
  (interactive)
  (let ((opt (read-string "Options: " (journalctl-unparse-options))))
    (journalctl-parse-options opt)
    (journalctl t journalctl-current-chunk)))

#+END_SRC

*** Main function

#+BEGIN_SRC emacs-lisp
(defun journalctl (&optional opt chunk)
 "Run journalctl with give OPT and present CHUNK of  output in a special buffer.
If OPT is t the options in 'journalctl-current-opts' are taken."
  (interactive)
  (unless (eq opt t)
  (let ((opt (or opt (read-string "option: " "-x  -n 1000" nil "-x "))))
    (journalctl-parse-options opt)))
    (let ((opt (journalctl-unparse-options)))
    (setq journalctl-current-lines (string-to-number (shell-command-to-string (concat "journalctl " opt "|  wc -l"))))
    (let* ((this-chunk (or chunk  0)) ;; if chunk is not explicit given, we assume this first (0) chunk
	         (first-line (+ 1 (* this-chunk journalctl-chunk-size)))
	         (last-line (if (<= (+ first-line journalctl-chunk-size)
                              journalctl-current-lines)
			                    (+ first-line journalctl-chunk-size)
		                    journalctl-current-lines)))
      (with-current-buffer (get-buffer-create "*journalctl*")
        (setq buffer-read-only nil)
        (fundamental-mode)
        (erase-buffer))
      (save-window-excursion
       (shell-command (concat "journalctl " opt journalctl-current-filter
                              " | sed -ne '"  (int-to-string first-line) ","
                              (int-to-string last-line) "p'")
                      "*journalctl*" "*journalctl-error*"))
      (switch-to-buffer "*journalctl*")
      (setq buffer-read-only t)
;;      (setq journalctl-current-opts opt)
      (journalctl-mode))))
#+END_SRC

